import 'package:fuzzywuzzy/fuzzywuzzy.dart';
import 'package:pillkaboo/src/app/tts/tts_service.dart';

import '../../../../styles/pillkaboo_theme.dart';
import '../../../../../core/pillkaboo_util.dart';
import '../../../../widgets/index.dart' as widgets;

import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:provider/provider.dart';
import 'package:google_fonts/google_fonts.dart';

import 'allergy_add_page_model.dart';
export 'allergy_add_page_model.dart';


class AllergyAddPageWidget extends StatefulWidget {
  const AllergyAddPageWidget({super.key});

  @override
  State<AllergyAddPageWidget> createState() => _AllergyAddPageWidgetState();
}

class _AllergyAddPageWidgetState extends State<AllergyAddPageWidget> {
  late AllergyAddPageModel _model;
  final TextEditingController _controller = TextEditingController();
  final FocusNode _focusNode = FocusNode();
  final List<String> possibleAllergies = ['0.1%시아노코발라민', '50%토코페롤아세테이트', '9-아미노아크리딘운데실렌산', 'B-카로틴현탁액30%', 'D-α-토코페롤아세테이트', 'D-비오틴', 'D-소르비톨', 'D-소르비톨액70%', 'D-판테놀', 'DL-메티오닌', 'DL-메틸에페드린염산염', 'DL-멘톨', 'DL-카르니틴염산염', 'DL-캄파', 'DL-포스포세린', 'E.colistrainNissle1917의Biomass', 'L-글루타민', 'L-글루탐산', 'L-류신', 'L-리신염산염', 'L-메티오닌', 'L-멘톨', 'L-발린', 'L-시스테인', 'L-시스틴', 'L-시트룰린', 'L-아르기닌', 'L-아르기닌염산염', 'L-아스코르브산나트륨', 'L-아스파라긴산마그네슘·칼륨등량혼합물', 'L-아스파르트산-L-아르기닌', 'L-아스파르트산-L-아르기닌수화물', 'L-아스파르트산-L-오르니틴', 'L-아스파르트산-L-오르니틴수화물', 'L-아스파르트산L-오르니틴', 'L-아스파르트산칼륨', 'L-알라닌', 'L-오르니틴염산염', 'L-이소류신', 'L-카르니틴', 'L-카르보시스테인', 'L-트레오닌', 'L-트리프토판', 'L-페닐알라닌', 'L-포스포세린', 'L-포스포트레오닌', 'N-미리스틸-3-하이드록시부틸아민염산염', 'P-아미노벤조산', 'S-디아세틸시스테인', 'Tinnevelly센나열매가루', 'd-α-토코페롤숙시네이트', 'd-브롬페니라민말레산염', 'd-비오틴', 'd-비오틴1%', 'd-캄파', 'd-클로르페니라민말레산염', 'dl-메틸에페드린염산염', 'dl-카르니틴염산염', 'dl-캄파', 'dl-캄퍼', 'l-멘톨', 'p-아미노벤조산', 'r-오리자놀', 'β-카로틴10%', 'β-카로틴20%과립', 'β-카로틴30%현탁액', 'β-카로틴현탁액30%', 'γ-오리자놀', 'ㅣ-멘톨', '가수과산화벤조일', '간가수분해물(4→1)', '간유', '갈근', '갈근탕건조엑스(10→1)', '갈근탕건조엑스(4→1)', '갈근탕건조엑스[10→1]', '갈근탕엑스(10→1)', '갈근탕연조엑스(3.08→1)', '감마-오리자놀', '감마오리자놀', '감초', '감초30%에탄올유동엑스', '감초가루', '감초건조엑스(5→1)', '감초엑스', '감초엑스(3->1)', '감초엑스(4→1)', '감초엑스(5.9→1)', '감초엑스분말(14.3→1)', '감초엑스산', '감초엑스산(5→1)', '감초연조엑스(2.8~3.4→1)', '강세트리마이드40%용액', '강활', '갱미', '건강', '건강50%에탄올틴크(1→5)', '건강70%에탄올틴크(1→5)', '건강가루', '건강건조엑스(5ㆍ6→1)', '건강틴크', '건조레티놀아세테이트', '건조레티놀아세테이트분말', '건조레티놀팔미테이트과립', '건조수산화알루미늄겔', '건조에르고칼시페롤', '건조에르고칼시페롤과립', '건조엑스로서', '건조초산레티놀과립', '건조콜레칼시페롤', '건조황산제일철', '건조효모', '게스토덴', '겐타마이신황산염', '겐티아나', '결정글루코사민황산염', '결정트립신', '경질산화마그네슘', '계피가루', '계피건조엑스(31.3→1)', '계피틴크', '고목', '고목가루', '고추80%에탄올연조엑스', '고추틴크', '과산화벤조일', '과산화수소수30%', '과산화수소수35%', '과아세트산액0.2%', '과탄산나트륨', '관류용멸균증류수', '괄루인엑스산', '구기자', '구기자유동엑스', '구아야줄렌', '구아야콜', '구아야콜설폰산칼륨', '구아이페네신', '구연산칼슘', '규산알루민산마그네슘', '글루콘산제이철나트륨착염', '글루콘산제일철수화물', '글루콘산칼슘수화물', '글루콘산클로르헥시딘액', '글루콘산클로르헥시딘액20%', '글루쿠로노락톤', '글루타랄농축액', '글루타민', '글루타티온(환원형)', '글리세로인산마그네슘', '글리세린', '글리시레틴산', '글리시리진산', '글리시리진산디칼륨', '글리시리진산암모늄', '글리시리진산이칼륨', '글리신', '글리코피롤레이트', '금은화', '길경', '길경33.3%에탄올유동엑스(4->1)', '길경50%에탄올건조엑스(10→1)', '길경가루', '길경엑스(3.7→1)', '길경엑스산', '길경엑스산(3.7→1)', '길경연조엑스(1.8~2.2→1)', '길경유동엑스', '나파졸린염산염', '나프록센', '나프록센나트륨', '나프티핀염산염', '남천실30%에탄올유동엑스', '네오마이신황산염', '네오스티그민메틸황산염', '노녹시놀9', '노닐산바닐릴아미드', '노닐산바닐아미드', '노스카핀', '노스카핀염산염수화물', '노회', '노회건조엑스', '노회엑스', '녹용35%에탄올틴크(3->10)', '녹용50%에탄올유동엑스', '녹용60%에탄올틴크', '농글리세린', '농축콜레칼시페롤', '농축콜레칼시페롤(분말형)', '농축콜레칼시페롤(유상)', '농축콜레칼시페롤과립', '농축콜레칼시페롤분말', '농축콜레칼시페롤산', '농축콜레칼시페롤유', '뉴라제', '니자티딘', '니코틴', '니코틴산벤질(피리딘-베타-카르복실산벤질에스테르)', '니코틴산아마이드', '니코틴산아미드', '니코틴산아미드3배산', '니코틴산아미드99ㆍ5%', '니코틴아마이드', '니코틴타르타르산염수화물', '니코틴폴라크리렉스', '니코틴폴라크릴렉스', '니트로푸라존', '니푸록사지드', '담죽엽', '당귀', '당귀연조엑스(2.5~3.1→1)', '당약', '당약가루', '당화균', '대두황권', '대추', '데소게스트렐', '덱사메타손', '덱사메타손프로피오네이트', '덱스클로르페니라민말레산염', '덱스트란70', '덱스트로메토르판브롬화수소산염', '덱스트로메토르판브롬화수소산염수화물', '덱스판테놀', '덱시부프로펜', '덱시부프로펜디.씨', '덱시부프로펜디.씨.', '도르졸라미드염산염', '도큐세이트나트륨', '독시라민석시네이트', '독시라민숙신산염', '돔페리돈', '동클로로필', '두시', '두충30%에탄올유동엑스', '디메치콘', '디메티콘', '디메틸폴리실록산ㆍ이산화규소혼합물', '디멘히드리네이트', '디부카인염산염', '디사이클로민염산염', '디시클로민염산염', '디아스타제', '디아스타제.프로테아제', '디아스타제.프로테아제.셀룰라제2000Ⅱ', '디아스타제·프로테아제', '디아스타제·프로테아제100', '디아스타제·프로테아제N1', '디아스타제·프로테아제·셀룰라제', '디아스타제·프로테아제·셀룰라제1000', '디아스타제·프로테아제·셀룰라제2000II', '디아스타제·프로테아제·셀룰라제2000IV', '디엘멘톨', '디엘캄파', '디오스민', '디옥타헤드랄스멕타이트', '디클로페낙', '디클로페낙나트륨', '디클로페낙디에칠암모늄', '디클로페낙디에틸아민', '디클로페낙디에틸아민염', '디클로페낙디에틸암모늄', '디클로페낙에폴아민', '디펜히드라민', '디펜히드라민염산염', '디프로필린', '디히드록시디부틸에테르', '라니티딘염산염', '락토민', '락토바실루스람노수스R0011균락토바실루스헬베티쿠스R0052균혼합분말', '락토바실루스스포로게네스균', '락토바실루스아시도필루스', '락토바실루스아시도필루스균', '락토바실루스카제이변종람노수스의동결건조배양물', '락툴로오스농축액', '락툴로오스액', '락툴로오즈농축액', '락트산', '락트산마그네슘수화물', '락트산암모늄액', '락트산칼슘수화물', '락티톨수화물', '락티톨일수화물', '레보노르게스트렐', '레보카르니틴', '레보클로페라스틴펜디조산염', '레보플록사신수화물', '레티놀아세테이트', '레티놀아세테이트과립', '레티놀팔미테이트', '레티놀팔미테이트과립', '레티놀팔미테이트농축분말', '레티놀팔미테이트유', '로라타딘', '로얄젤리', '로페라미드염산염', '록소프로펜나트륨수화물', '루론딘', '리도카인', '리도카인염산염', '리도카인염산염수화물', '리도카인염산염일수화물', '리보플라빈', '리보플라빈3배산', '리보플라빈부티레이트', '리보플라빈포스페이트나트륨', '리소짐염산염', '리파제', '리파제AP12', '리파제AP6', '리파제Ⅱ', '마늘건조엑스(100→1)', '마늘엑스(100->1)', '마늘엑스(100→1)', '마늘엑스가루(100→1)', '마늘유', '마크로골4000', '마황', '마황엑스산', '말레인산카르비녹사민', '말레인산페니라민', '말레인산피릴라민', '맥문동', '맥문동30%에탄올유동엑스', '맥문동탕연조엑스(2.7→1)', '맥아', '메칠-N', '메코발라민', '메퀴타진', '메클리진염산염수화물', '메타규산알루민산마그네슘', '메타규산알루민산마그네슘(건조물로서)', '메틸-N', '메틸메티오닌설포늄염화물', '멘톤', '멘톨', '멸균등장해수', '멸균천연해수', '목과', '목근피틴크', '목단피건조엑스(4→1)', '목별자', '목향', '몰리브덴산나트륨', '몰리브덴산나트륨수화물', '몰리브덴함유건조효모', '몰약', '무수액체라놀린', '무수인산수소칼슘', '무수카페인', '무수황산제이구리', '무정형에스신', '무피로신', '뮤코폴리사카리드폴리설페이트', '미녹시딜', '미세정제플라보노이드분획물', '미코나졸질산염', '밀크시슬열매건조엑스', '바시트라신', '바시트라신아연', '바실루스나토엔티주균가루', '바실루스리케니포르미스균', '바실루스서브틸리스균', '바실루스서브틸리스균·엔테로코쿠스페슘균배양물', '바실루스폴리퍼멘티쿠스엔에스피균', '박하', '박하유', '반비틴크(1→5)', '반하', '방풍', '방풍연조엑스(2.1~2.5→1)', '방풍통성산건조엑스(4.6→1)', '백단향', '백렴', '백색바셀린', '백지연조엑스(2.7~3.3→1)', '백출', '밸라돈나총알카로이드', '베르베린염화물수화물', '베르베린탄닌산염', '베타-갈락토시다제(아스퍼길루스)', '베타-카로틴20%', '베타-카로틴현탁액30%', '베타메타손발레레이트', '베타시토스테롤', '베타인', '베타인염산염', '베타카로틴20%과립', '베타카로틴30%현탁액', '베타카로틴현탁액30%', '벤잘코늄염화물', '벤잘코늄염화물액', '벤제토늄염화물', '벤조산', '벤조산나트륨카페인', '벤지다민염산염', '벤포티아민', '벤프로페린인산염', '벨라돈나총알카로이드', '벨라돈나총알칼로이드', '보르네올', '보에마이트', '복령', '부타미레이트시트르산염', '부테나핀염산염', '부틸스코폴라민브롬화물', '불화나트륨', '브로멜라인', '브롬페니라민말레산염', '브롬헥신염산염', '브리모니딘타르타르산염', '비사코딜', '비스무트차질산염', '비스벤티아민', '비오디아스타제1000', '비오디아스타제2000', '비오디아스타제500', '비오틴', '비타민A', '비타민A아세테이트과립', '비타민A유', '비타민D3타입100CWS', '비타민E', '비타민이프리퍼레이션', '비포나졸', '빌베리건조엑스', '빌베리건조엑스3.0%', '빌베리열매건조가루', '사유', '사인', '사카로마이세스보울라르디균', '사향', '산사', '산약', '산초30%에탄올연조엑스(3.3→1)', '산화마그네슘', '산화아연', '산화에틸렌', '산화제이구리', '살리실산', '살리실산글리콜', '살리실산디에틸아민', '살리실산메칠', '살리실산메틸', '생강', '생강엑스산', '서양칠엽수종자엑스(6→1)', '석고', '설파메톡사졸', '설파메톡사졸나트륨', '세네가가루', '세네가유동엑스', '세르타코나졸질산염', '세신', '세인트존스워트80%메탄올건조엑스', '세티리진염산염', '세틸피리디늄염화물', '세틸피리디늄염화물수화물', '세파연조엑스(1.8→1)', '센나및센나열매메탄올건조엑스(1000→7)', '센나열매가루', '센나엽가루', '센나엽엑스', '센노사이드칼슘', '센노시드', '센텔라정량추출물', '셀레늄0.1%가루', '셀레늄가루0.1%', '셀레늄함유건조효모', '셀렌산나트륨', '셀룰라제', '셀룰라제AP3', '셀룰라제II', '셀룰라제Ⅱ', '소브레롤', '소청룡탕건조엑스', '소청룡탕건조엑스(13→1)', '소청룡탕엑스분말(8.4→1)', '소청룡탕연조엑스(1.67→1)', '수도에페드린염산염', '수산화마그네슘', '수산화알루미늄겔(13%)', '수산화알루민산마그네슘', '수용성아줄렌', '슈도에페드린염산염', '슈도에페드린황산염', '스코폴라민', '스코폴라민브롬화수소산염수화물', '스코폴리아엑스', '스코폴리아엑스10배산', '스코폴리아엑스3배산', '시네올', '시메치콘', '시메티딘', '시메티콘', '시메티콘산', '시메티콘파우더', '시아노코발라민', '시아노코발라민1%', '시아노코발라민1000배산', '시아노코발라민100배산', '시아노코발라빈1000배산', '시클로피록스', '시클로피록스올아민', '시트룰린말산염', '시트르산', '시트르산나트륨수화물', '시트르산마그네슘', '시트르산마그네슘수화물', '시트르산수화물', '시트르산칼륨수화물', '시트르산칼슘', '시트르산칼슘수화물', '시티딘', '시프로헵타딘오로트산염수화물', '시호', '시호연조엑스(4.5~5.6→1)', '신곡', '신이건조엑스(9.1→1)', '쌍화탕연조엑스', '아교', '아기오락스원료과립(Agiolaxpregranules)', '아네톨', '아데닌염산염', '아르기닌', '아르기닌티디아시케이트', '아모롤핀염산염', '아미노벤조산에틸', '아미노카프로산', '아선약', '아선약가루', '아세트아미노펜', '아세트아미노펜(미분화)', '아세트아미노펜과립', '아세트아미노펜제피세립', '아세틸시스테인', '아셀렌산나트륨', '아셀렌산나트륨오수화물', '아스코르브산', '아스코르브산90%과립', '아스코르브산97', '아스코르브산97%', '아스코르브산97%과립', '아스코르브산과립', '아스코르브산과립90%', '아스코르브산과립97%', '아스코르브산칼슘수화물', '아스피린', '아스피린장용과립', '아시클로버', '아이비엽70%에탄올유동엑스', '아젤라산', '아줄렌설폰산나트륨', '아크리놀수화물', '알긴산', '알긴산나트륨', '알란토인', '알릴이소프로필아세틸우레아', '알마게이트', '알벤다졸', '알코올', '알킬디아미노에틸글리신염산염액40%', '알파칼시돌', '알파트라디올', '암브록솔염산염', '약용탄', '약용효모', '양파엑스액(1.8→1)', '양파연조엑스(1.8→1)', '양파추출액', '양파추출액(1.8→1)', '에녹솔론', '에르고칼시페롤', '에르고칼시페롤과립', '에르도스테인', '에스신', '에치닐에스트라디올', '에코나졸질산염', '에탄올', '에탄올96%', '에텐자미드', '에티닐에스트라디올', '에페드린염산염', '엔-아세틸아스파틸글루타민산나트륨', '엔테로코쿠스페슘스트레인세르넬레68균', '엔테로코쿠스페슘스트레인세르넬레68균ME', '엔테로코쿠스페칼리스BIO-4R균', '엔테로코쿠스페칼리스F-100균', '엘-시스틴', '엘-카르니틴', '엘멘톨', '엘시스테인', '엘시스틴', '엘카르니틴', '연교', '연교연조엑스(2.3~2.9→1)', '염산슈도에페드린', '염산트리프롤리딘', '염화나트륨', '염화리소짐', '염화마그네슘', '염화마그네슘수화물', '염화메틸벤제토늄', '염화세칠피리디늄', '염화세틸피리디늄', '염화세틸피리디늄수화물', '염화알루미늄', '염화알루미늄수화물', '염화암모늄', '염화칼륨', '염화칼슘수화물', '염화크롬', '염화크롬수화물', '영양각', '오로트산수화물', '오로트산카르니틴', '오매', '오미자', '오소판물질', '옥세타자인', '옥시메타졸린염산염', '옥테니딘염산염', '요소', '요오드', '요오드화칼륨', '용뇌', '용담가루', '용담유동엑스', '용담유동엑스(1→1)', '우담즙건조엑스', '우담즙엑스', '우레아', '우루소데옥시콜산', '우르소데옥시콜산', '우리딘', '우방자', '우황', '우황60%에탄올틴크', '우황60%에탄올틴크(1->100)', '울금가루', '울금건조엑스(15→1)', '원지', '원지가루', '위령선', '유당수화물', '유비데카레논', '유비데카레논(코엔자임Q10)', '유비데카레논10%', '유포자성유산균', '유향', '육계', '육계30%에탄올유동엑스', '육계50%에탄올틴크(1→5)', '육계70%에탄올틴크(1->5)', '육계70%에탄올틴크(1→5)', '육계가루', '육계건조엑스', '육계엑스산', '육계유', '육두구', '육두구가루', '은행엽건조엑스', '은행엽엑스', '음양곽35%에탄올엑스', '음양곽엑스(10->1)', '의이인건조엑스', '의이인엑스(13→1)', '이노시톨', '이부프로펜', '이부프로펜리신', '이부프로펜아르기닌', '이부프로펜피코놀', '이상건조엑스로서', '이소코나졸질산염', '이소프로판올', '이소프로필메틸페놀', '이소프로필안티피린', '인도메타신', '인산수소마그네슘수화물', '인산수소칼슘수화물', '인산알루미늄겔', '인산이수소나트륨', '인산이수소나트륨수화물', '인산일수소나트륨', '인산일수소나트륨수화물', '인산일수소칼륨', '인삼', '인삼30%에탄올건조엑스', '인삼30%에탄올건조엑스(6.7→1)', '인삼30%에탄올엑스', '인삼35%에탄올건조엑스(14.9->1)', '인삼가루', '인삼건조엑스', '인삼건조엑스(14.5→1)', '인삼건조엑스(6.7→1)', '인삼유동엑스', '인진호탕건조엑스', '인진호탕건조엑스(10→1)', '자근건조엑스(3→1)', '자단향', '자소엽', '자소엽건조엑스(7.8~9.5→1)', '자소엽건조엑스(7.8∼9.5→1)', '자소엽엑스산', '자오가건조엑스(25→1)', '자일로메타졸린염산염', '자하거엑스', '작약', '작약가루', '작약엑스(5.9->1)', '작약엑스(5.9→1)', '작약엑스산', '작약연조엑스(2.4~3.0→1)', '저농도과아세트산평형혼합물', '정향', '정향가루', '젖산암모늄액', '제삼인산칼슘', '제피아스코르브산', '제피아스코르빈산', '주성분', '지각연조엑스(1.5~1.8→1)', '지실', '직타용아스코르브산', '직타용아스코르브산97%', '진피', '진피70%에탄올틴크(1→5)', '진피가루', '진피건조엑스', '진피건조엑스(5→1)', '진피연조엑스', '진피틴크', '질산치아민', '차아염소산나트륨0.14%액', '차전자가루', '차전자피(Plantaginisovataetesta:Ispaghulahusk)', '차전초유동엑스', '창출', '창출30%에탄올유동엑스', '창출30%에탄올유동엑스(1→1)', '천궁', '천궁건조엑스', '천궁연조엑스(2.6~3.1→1)', '철-아세틸트랜스페린', '철단백추출물', '철만니톨난단백', '철아세틸트랜스페린', '초과', '초산디알파토코페롤', '초산토코페롤50%', '치자연조엑스(1.9~2.4→1)', '치자연조엑스(3.0-->1)', '치자연조엑스(3.0→1)', '침강탄산칼슘', '카르두스마리아누스엑스', '카르바조크롬', '카르보시스테인', '카르복시메틸셀룰로오스나트륨', '카르비녹사민말레산염', '카밀레화틴크(1:4.5)', '카바마이드퍼옥사이드', '카바마이드퍼옥시드', '카보머', '카산트라놀', '카올린', '카페인무수물', '카페인수화물', '칼슘시트레이트말레이트', '캄펜', '케라틴', '케토코나졸', '케토티펜푸마르산염', '케토프로펜', '코바마미드', '콘드로이틴설페이트나트륨', '콜레칼시페롤', '콜레칼시페롤과립', '콜레칼시페롤농축물(분말형)', '콜레칼시페롤농축물(유상형)', '콜레칼시페롤농축분말', '콜레칼시페롤혼합물', '콜로이드성인산알루미늄', '콜린타르타르산염', '콩기름불검화물', '크로모글리크산나트륨', '크로몰린나트륨', '크로타미톤', '크롬함유건조효모', '크리아제-PEG', '클레마스틴푸마르산염', '클로닉신리시네이트', '클로르족사존', '클로르페니라민말레산염', '클로르페니라민말레인산염', '클로르헥시딘글루콘산염액', '클로르헥시딘아세트산염', '클로르헥시딘염산염', '클로스트리듐부티리쿰토아균', '클로트리마졸', '클로페라스틴염산염', '타우린', '탄닌산', '탄산마그네슘', '탄산수소나트륨', '탄산수소칼륨', '탄산칼슘', '탄산칼슘91%과립', '탄산칼슘95%과립', '탄산칼슘과립95%', '테르비나핀', '테르비나핀염산염', '테트라히드로졸린염산염', '토코페롤', '토코페롤숙시네이트칼슘', '토코페롤아세테이트', '토코페롤아세테이트2배산', '토코페롤아세테이트50%', '토코페롤아세테이트50%과립', '톨나프테이트', '트라넥삼산', '트레할로스수화물', '트록세루틴', '트롤아민', '트리메부틴말레산염', '트리메토퀴놀염산염수화물', '트리암시놀론아세토니드', '트리프롤리딘염산염', '트리프롤리딘염산염수화물', '티니벨리센나열매가루', '티로트리신', '티몰', '티몰롤말레산염', '티아민디설피드', '티아민모노포스페이트클로라이드', '티아민염산염', '티아민질산염', '티아민질산염3배산', '티아민질산염97%과립', '티페피딘시트르산염', '티페피딘히벤즈산염', '파라아미노벤조산', '파라아미노안식향산', '파마브롬', '파모티딘', '파파베린염산염', '파파인', '판셀라제', '판크레리파아제', '판크레리파제', '판크레아스분말', '판크레아틴', '판크레아틴장용과립', '판크레아틴장용성제피미세정', '판크레아틴장용성제피정', '판크레아틴장용성제피펠렛', '판테놀', '판테틴', '판토텐산칼슘', '판토텐산칼슘에스', '판토텐산칼슘타입S', '판프로신', '패장', '페녹시에탄올', '페니라민말레산염', '페니레프린염산염', '페닐레프린염산염', '펙소페나딘염산염', '펙틴', '펜콘', '펜톡시베린시트르산염', '펠비낙', '펩신', '포도당', '포도엽건조엑스', '포비돈', '포비돈요오드', '포황', '폴리네이트칼슘', '폴리데옥시리보뉴클레오티드나트륨', '폴리말토오스수산화제이철착염', '폴리믹신B황산염', '폴리사카리드철착염', '폴리소르베이트80', '폴리에틸렌글리콜3350', '폴리에틸렌글리콜400', '폴리에틸렌글리콜4000', '폴리크레줄렌액50%', '폴산', '표준화된박테리아배양액', '푸르설티아민', '푸르설티아민염산염', '푸마르산철', '퓨시드산나트륨', '퓨시드산수산화물', '퓨시드산수화물', '프라목신염산염', '프레드니솔론', '프레드니솔론발레로아세테이트', '프레드니솔론아세테이트', '프로자임', '프로자임6', '프로판올', '플루르비프로펜', '플루벤다졸', '플루오르화나트륨', '피레트린엑스', '피록시캄', '피리독살포스페이트수화물', '피리독신염산염', '피리독신염산염3배산', '피리독신염산염97%과립', '피리티온아연액', '피마자', '피토나디온', '피토나디온5%', '피토나디온5%건조분말', '피페로닐부톡시드', '핀넨', '핀넨(α+β)', '필발', '함당펩신', '합성규산알루미늄', '합성비타민A농축분말', '항독성간장엑스', '행인', '행인가루', '행인엑스산', '향부자', '향소산건조엑스(8->1)', '향소산연조엑스[3.14→1]', '헤미셀룰라제', '헤파리노이드', '헤파린나트륨', '헵타미놀염산염', '현초가루', '현호색', '형개', '형개연조엑스(4.6~5.7→1)', '홍삼30%에탄올건조엑스', '홍삼70%에탄올연조엑스', '홍화유', '황금', '황금건조엑스(6→1)', '황금연조엑스(2.0~2.5→1)', '황기', '황기건조엑스', '황기건조엑스(8→1)', '황기엑스(7.4→1)', '황기엑스산', '황련', '황련가루', '황련건조엑스(6→1)', '황련건조엑스(8.93→1)', '황련엑스산', '황백', '황백가루', '황백건조엑스(6→1)', '황백엑스산', '황백연조엑스(3.3-->1)', '황백연조엑스(3.3->1)', '황백연조엑스(3.3→1)', '황산구리', '황산망간', '황산망간수화물', '황산망간일수화물', '황산아연', '황산아연수화물', '황산아연일수화물', '황산제이구리', '황산제이구리수화물', '황산칼륨', '황정30%에탄올유동엑스', '회향', '회향30%에탄올틴크(1→5)', '회향가루', '회향유', '후박', '히드로코르티손', '히드로코르티손아세테이트', '히드로퀴논', '히드로탈시드', '히드로탈시트', '히드록소코발라민아세트산염', '히드록시프로필메칠셀룰로오스2910', '히스티딘아연이수화물', '히알루론산나트륨', '히프로멜로오스', '히프로멜로오스2910'];
  final scaffoldKey = GlobalKey<ScaffoldState>();

  @override
  void initState() {
    super.initState();
    _model = createModel(context, () => AllergyAddPageModel());
    WidgetsBinding.instance.addPostFrameCallback((_) {
      _focusNode.requestFocus();
    });
  }

  @override
  void dispose() {
    _controller.dispose();
    _focusNode.dispose();
    _model.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) {
    if (isiOS) {
      SystemChrome.setSystemUIOverlayStyle(
        SystemUiOverlayStyle(
          statusBarBrightness: Theme.of(context).brightness,
          systemStatusBarContrastEnforced: true,
        ),
      );
    }

    context.watch<PKBAppState>();

    double appBarFontSize = 32.0/892.0 * MediaQuery.of(context).size.height;
    double backIconSize = 30.0/892.0 * MediaQuery.of(context).size.height;

    return GestureDetector(
      onTap: () => _model.unfocusNode.canRequestFocus
          ? FocusScope.of(context).requestFocus(_model.unfocusNode)
          : FocusScope.of(context).unfocus(),
      child: Scaffold(
        key: scaffoldKey,
        backgroundColor: PKBAppState().tertiaryColor,
        appBar: AppBar(
          backgroundColor: PKBAppState().tertiaryColor,
          automaticallyImplyLeading: false,
          title: Semantics(
            container: true,
            label: '알러지 성분 추가',
            child: ExcludeSemantics(
              excluding: true,
              child: Text(
                '알러지 성분 추가',
                style: PillKaBooTheme.of(context).headlineMedium.override(
                  fontFamily: PillKaBooTheme.of(context).headlineMediumFamily,
                  color: PKBAppState().secondaryColor,
                  fontSize: appBarFontSize,
                  fontWeight: FontWeight.bold,
                  useGoogleFonts: GoogleFonts.asMap().containsKey(PillKaBooTheme.of(context).headlineMediumFamily),
                ),
              ),
            ),
          ),
          actions: const [
            widgets.HomeButtonWidget(),
          ],
          centerTitle: false,
          elevation: 2.0,
        ),
        body: SafeArea(
          top: true,
          child: Column(
            mainAxisSize: MainAxisSize.max,
            mainAxisAlignment: MainAxisAlignment.start,
            crossAxisAlignment: CrossAxisAlignment.center,
            children: [
              Center(
                child: SizedBox(
                width: MediaQuery.of(context).size.width - 40,
                height: 60,
                child: TextField(
                controller: _controller,
                focusNode: _focusNode,
                decoration: InputDecoration(
                  hintText: '알레르기 성분을 입력해주세요',
                  filled: true,
                  fillColor: PKBAppState().secondaryColor,
                  contentPadding: const EdgeInsets.fromLTRB(10.0, 20.0, 10.0, 20.0),
                  border: OutlineInputBorder(
                    borderSide: BorderSide.none,
                    borderRadius: BorderRadius.circular(10.0),
                  ),
                ),
                style: TextStyle(
                  color: PKBAppState().tertiaryColor,
                  fontSize: 20,
                  fontWeight: FontWeight.bold,
                  fontFamily: 'Pretendard',
                ),
                autofocus: true,
              ),),),
              const SizedBox(height: 10), 
              SizedBox(
                width: MediaQuery.of(context).size.width - 40,
                height: 60,
                child: ElevatedButton(
                  style: ButtonStyle(
                    backgroundColor: MaterialStateProperty.all(PKBAppState().tertiaryColor),
                    shape: MaterialStateProperty.all<RoundedRectangleBorder>(
                      RoundedRectangleBorder(
                        borderRadius: BorderRadius.circular(26.0),
                        side: BorderSide(color: PKBAppState().secondaryColor),
                      ),
                    ),
                  ),
                  onPressed: () async {
                    int max = 0;
                    String maxWord = '';
                    if (_controller.text.isEmpty) {
                      TtsService().speak('알레르기 성분을 입력해주세요.');
                      return;
                    }
                    for (String word in possibleAllergies) {
                      if (tokenSetPartialRatio(word, _controller.text) > max) {
                        maxWord = word;
                        max = tokenSetPartialRatio(word, _controller.text);
                      }
                    }
                    if (max >= 80) _controller.text = maxWord;
                    setState(() {
                      PKBAppState().addToUserAllergies(_controller.text);
                    });
                    TtsService().speak('${_controller.text} 알레르기 성분으로 추가되었습니다.');
                    context.pushReplacement('/allergyListPage');
                  },
                  child: Text('확인',
                      style: TextStyle(
                        color: PKBAppState().secondaryColor,
                        fontSize: backIconSize,
                        fontWeight: FontWeight.bold,
                        fontFamily: 'Pretendard',
                      )
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}